[
    {
        "text": "No offer letter is worth losing your mental peace over. Every time I poured my heart into 5-6 rounds of interviews and faced rejection, it felt like a punch in the gut.",
        "engagement": 1080
    },
    {
        "text": "LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn’t even apply for!' The catch? Pay Rs. 50,000 for the honor. A recruiter once told me, 'You’re great, but not for us.'",
        "engagement": 1137
    },
    {
        "text": "Let this be your reminder: You’re doing your best. Looking for jobs on LinkedIn is like online dating: Full of promises, but in the end, you’re just left ghosted.",
        "engagement": 890
    },
    {
        "text": "A recruiter once told me, 'You’re great, but not for us.' Next time when I'll be reading some LinkedIn Influencer's story, I am starting from the last line. If there's a link attached to it, it's most probably a fake one.",
        "engagement": 344
    },
    {
        "text": "Jobseekers, this one’s for you. Every application, every interview, every follow-up… the pressure is immense. Even my dog thinks I’m employed with how much I’m on my laptop.",
        "engagement": 1100
    },
    {
        "text": "I once met someone who got ghosted after 9 rounds. Every time I poured my heart into 5-6 rounds of interviews and faced rejection, it felt like a punch in the gut.",
        "engagement": 1062
    },
    {
        "text": "Every post I read makes me feel more human. So when I left a toxic work environment, I told my manager a simple thing and felt so good.",
        "engagement": 965
    },
    {
        "text": "A recruiter once told me, 'You’re great, but not for us.' Just saw a LinkedIn Influencer with 'Organic Growth' written in the profile with 65K+ followers claiming that he can help you in growing your platform, copying the posts from other influencers.",
        "engagement": 117
    },
    {
        "text": "I was once told that I was too ambitious, too driven, and that I should tone it down. Today, I chose rest over endless scrolling.",
        "engagement": 1136
    },
    {
        "text": "Jobseekers, this one’s for you. Every application, every interview, every follow-up… the pressure is immense. Let this be your reminder: You’re doing your best.",
        "engagement": 180
    },
    {
        "text": "Just saw a LinkedIn Influencer with 'Organic Growth' written in the profile with 65K+ followers claiming that he can help you in growing your platform, copying the posts from other influencers. Today, I chose rest over endless scrolling.",
        "engagement": 1078
    },
    {
        "text": "Next time when I'll be reading some LinkedIn Influencer's story, I am starting from the last line. If there's a link attached to it, it's most probably a fake one. A recruiter once told me, 'You’re great, but not for us.'",
        "engagement": 986
    },
    {
        "text": "Let’s normalize rejections and not tie them to our self-worth. Next time when I'll be reading some LinkedIn Influencer's story, I am starting from the last line. If there's a link attached to it, it's most probably a fake one.",
        "engagement": 1009
    },
    {
        "text": "Just saw a LinkedIn Influencer with 'Organic Growth' written in the profile with 65K+ followers claiming that he can help you in growing your platform, copying the posts from other influencers. Even my dog thinks I’m employed with how much I’m on my laptop.",
        "engagement": 542
    },
    {
        "text": "I was once told that I was too ambitious, too driven, and that I should tone it down. Let this be your reminder: You’re doing your best.",
        "engagement": 539
    },
    {
        "text": "A recruiter once told me, 'You’re great, but not for us.' Just saw a LinkedIn Influencer with 'Organic Growth' written in the profile with 65K+ followers claiming that he can help you in growing your platform, copying the posts from other influencers.",
        "engagement": 246
    },
    {
        "text": "Let your ambition be louder than their rejections. LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn’t even apply for!' The catch? Pay Rs. 50,000 for the honor.",
        "engagement": 625
    },
    {
        "text": "Looking for jobs on LinkedIn is like online dating: Full of promises, but in the end, you’re just left ghosted. Every post I read makes me feel more human.",
        "engagement": 165
    },
    {
        "text": "A recruiter once told me, 'You’re great, but not for us.' Looking for jobs on LinkedIn is like online dating: Full of promises, but in the end, you’re just left ghosted.",
        "engagement": 1084
    },
    {
        "text": "sapne dekhna achi baat hai, lekin job ka sapna dekh ke 'interested' likhna, yeh toh achi baat nahi hai na? Let’s normalize rejections and not tie them to our self-worth.",
        "engagement": 618
    },
    {
        "text": "I was once told that I was too ambitious, too driven, and that I should tone it down. Let this be your reminder: You’re doing your best.",
        "engagement": 143
    },
    {
        "text": "Jobseekers, this one’s for you. Every application, every interview, every follow-up… the pressure is immense. Let your ambition be louder than their rejections.",
        "engagement": 465
    },
    {
        "text": "I once met someone who got ghosted after 9 rounds. To everyone who's still looking for a job... I see you. I feel you.",
        "engagement": 272
    },
    {
        "text": "Let this be your reminder: You’re doing your best. Next time when I'll be reading some LinkedIn Influencer's story, I am starting from the last line. If there's a link attached to it, it's most probably a fake one.",
        "engagement": 132
    },
    {
        "text": "The reality of job hunting hit me hard this week. To everyone who's still looking for a job... I see you. I feel you.",
        "engagement": 890
    },
    {
        "text": "So when I left a toxic work environment, I told my manager a simple thing and felt so good. Every post I read makes me feel more human.",
        "engagement": 1104
    },
    {
        "text": "To everyone who's still looking for a job... I see you. I feel you. The reality of job hunting hit me hard this week.",
        "engagement": 1042
    },
    {
        "text": "So when I left a toxic work environment, I told my manager a simple thing and felt so good. The reality of job hunting hit me hard this week.",
        "engagement": 309
    },
    {
        "text": "Let your ambition be louder than their rejections. LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn’t even apply for!' The catch? Pay Rs. 50,000 for the honor.",
        "engagement": 426
    },
    {
        "text": "Even my dog thinks I’m employed with how much I’m on my laptop. I was once told that I was too ambitious, too driven, and that I should tone it down.",
        "engagement": 1097
    },
    {
        "text": "The reality of job hunting hit me hard this week. To everyone who's still looking for a job... I see you. I feel you.",
        "engagement": 782
    },
    {
        "text": "No offer letter is worth losing your mental peace over. Jobseekers, this one’s for you. Every application, every interview, every follow-up… the pressure is immense.",
        "engagement": 1118
    },
    {
        "text": "So when I left a toxic work environment, I told my manager a simple thing and felt so good. Today, I chose rest over endless scrolling.",
        "engagement": 394
    },
    {
        "text": "The reality of job hunting hit me hard this week. LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn’t even apply for!' The catch? Pay Rs. 50,000 for the honor.",
        "engagement": 1164
    },
    {
        "text": "Next time when I'll be reading some LinkedIn Influencer's story, I am starting from the last line. If there's a link attached to it, it's most probably a fake one. Every post I read makes me feel more human.",
        "engagement": 628
    },
    {
        "text": "Sometimes, we forget that a company’s brand name doesn’t define someone’s talent. No offer letter is worth losing your mental peace over.",
        "engagement": 268
    },
    {
        "text": "I was once told that I was too ambitious, too driven, and that I should tone it down. Every post I read makes me feel more human.",
        "engagement": 242
    },
    {
        "text": "Let’s normalize rejections and not tie them to our self-worth. So when I left a toxic work environment, I told my manager a simple thing and felt so good.",
        "engagement": 842
    },
    {
        "text": "Let this be your reminder: You’re doing your best. To everyone who's still looking for a job... I see you. I feel you.",
        "engagement": 1021
    },
    {
        "text": "The reality of job hunting hit me hard this week. Just saw a LinkedIn Influencer with 'Organic Growth' written in the profile with 65K+ followers claiming that he can help you in growing your platform, copying the posts from other influencers.",
        "engagement": 385
    },
    {
        "text": "To everyone who's still looking for a job... I see you. I feel you. Even my dog thinks I’m employed with how much I’m on my laptop.",
        "engagement": 488
    },
    {
        "text": "No offer letter is worth losing your mental peace over. So when I left a toxic work environment, I told my manager a simple thing and felt so good.",
        "engagement": 1090
    },
    {
        "text": "No offer letter is worth losing your mental peace over. Just saw a LinkedIn Influencer with 'Organic Growth' written in the profile with 65K+ followers claiming that he can help you in growing your platform, copying the posts from other influencers.",
        "engagement": 452
    },
    {
        "text": "Jobseekers, this one’s for you. Every application, every interview, every follow-up… the pressure is immense. A recruiter once told me, 'You’re great, but not for us.'",
        "engagement": 487
    },
    {
        "text": "I once met someone who got ghosted after 9 rounds. Jobseekers, this one’s for you. Every application, every interview, every follow-up… the pressure is immense.",
        "engagement": 969
    },
    {
        "text": "LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn’t even apply for!' The catch? Pay Rs. 50,000 for the honor. Today, I chose rest over endless scrolling.",
        "engagement": 1108
    },
    {
        "text": "Looking for jobs on LinkedIn is like online dating: Full of promises, but in the end, you’re just left ghosted. Let this be your reminder: You’re doing your best.",
        "engagement": 560
    },
    {
        "text": "A recruiter once told me, 'You’re great, but not for us.' Jobseekers, this one’s for you. Every application, every interview, every follow-up… the pressure is immense.",
        "engagement": 849
    },
    {
        "text": "Let’s normalize rejections and not tie them to our self-worth. Sometimes, we forget that a company’s brand name doesn’t define someone’s talent.",
        "engagement": 84
    },
    {
        "text": "To everyone who's still looking for a job... I see you. I feel you. Let’s normalize rejections and not tie them to our self-worth.",
        "engagement": 429
    },
    {
        "text": "Every post I read makes me feel more human. Sometimes, we forget that a company’s brand name doesn’t define someone’s talent.",
        "engagement": 757
    },
    {
        "text": "I was once told that I was too ambitious, too driven, and that I should tone it down. Today, I chose rest over endless scrolling.",
        "engagement": 820
    },
    {
        "text": "A recruiter once told me, 'You’re great, but not for us.' sapne dekhna achi baat hai, lekin job ka sapna dekh ke 'interested' likhna, yeh toh achi baat nahi hai na?",
        "engagement": 1053
    },
    {
        "text": "Looking for jobs on LinkedIn is like online dating: Full of promises, but in the end, you’re just left ghosted. I once met someone who got ghosted after 9 rounds.",
        "engagement": 288
    },
    {
        "text": "Just saw a LinkedIn Influencer with 'Organic Growth' written in the profile with 65K+ followers claiming that he can help you in growing your platform, copying the posts from other influencers. Every post I read makes me feel more human.",
        "engagement": 461
    },
    {
        "text": "Just saw a LinkedIn Influencer with 'Organic Growth' written in the profile with 65K+ followers claiming that he can help you in growing your platform, copying the posts from other influencers. I once met someone who got ghosted after 9 rounds.",
        "engagement": 260
    },
    {
        "text": "Let’s normalize rejections and not tie them to our self-worth. sapne dekhna achi baat hai, lekin job ka sapna dekh ke 'interested' likhna, yeh toh achi baat nahi hai na?",
        "engagement": 838
    },
    {
        "text": "sapne dekhna achi baat hai, lekin job ka sapna dekh ke 'interested' likhna, yeh toh achi baat nahi hai na? No offer letter is worth losing your mental peace over.",
        "engagement": 335
    },
    {
        "text": "Let this be your reminder: You’re doing your best. Every time I poured my heart into 5-6 rounds of interviews and faced rejection, it felt like a punch in the gut.",
        "engagement": 915
    },
    {
        "text": "Let’s normalize rejections and not tie them to our self-worth. sapne dekhna achi baat hai, lekin job ka sapna dekh ke 'interested' likhna, yeh toh achi baat nahi hai na?",
        "engagement": 96
    },
    {
        "text": "Let your ambition be louder than their rejections. Jobseekers, this one’s for you. Every application, every interview, every follow-up… the pressure is immense.",
        "engagement": 783
    },
    {
        "text": "sapne dekhna achi baat hai, lekin job ka sapna dekh ke 'interested' likhna, yeh toh achi baat nahi hai na? A recruiter once told me, 'You’re great, but not for us.'",
        "engagement": 443
    },
    {
        "text": "Today, I chose rest over endless scrolling. I was once told that I was too ambitious, too driven, and that I should tone it down.",
        "engagement": 187
    },
    {
        "text": "To everyone who's still looking for a job... I see you. I feel you. No offer letter is worth losing your mental peace over.",
        "engagement": 549
    },
    {
        "text": "I was once told that I was too ambitious, too driven, and that I should tone it down. Today, I chose rest over endless scrolling.",
        "engagement": 436
    },
    {
        "text": "To everyone who's still looking for a job... I see you. I feel you. Today, I chose rest over endless scrolling.",
        "engagement": 1188
    },
    {
        "text": "No offer letter is worth losing your mental peace over. sapne dekhna achi baat hai, lekin job ka sapna dekh ke 'interested' likhna, yeh toh achi baat nahi hai na?",
        "engagement": 644
    },
    {
        "text": "Next time when I'll be reading some LinkedIn Influencer's story, I am starting from the last line. If there's a link attached to it, it's most probably a fake one. No offer letter is worth losing your mental peace over.",
        "engagement": 181
    },
    {
        "text": "To everyone who's still looking for a job... I see you. I feel you. A recruiter once told me, 'You’re great, but not for us.'",
        "engagement": 563
    },
    {
        "text": "LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn’t even apply for!' The catch? Pay Rs. 50,000 for the honor. I once met someone who got ghosted after 9 rounds.",
        "engagement": 351
    },
    {
        "text": "Sometimes, we forget that a company’s brand name doesn’t define someone’s talent. Every post I read makes me feel more human.",
        "engagement": 684
    },
    {
        "text": "No offer letter is worth losing your mental peace over. I was once told that I was too ambitious, too driven, and that I should tone it down.",
        "engagement": 884
    },
    {
        "text": "I was once told that I was too ambitious, too driven, and that I should tone it down. Today, I chose rest over endless scrolling.",
        "engagement": 115
    },
    {
        "text": "The reality of job hunting hit me hard this week. Jobseekers, this one’s for you. Every application, every interview, every follow-up… the pressure is immense.",
        "engagement": 792
    },
    {
        "text": "Let this be your reminder: You’re doing your best. I was once told that I was too ambitious, too driven, and that I should tone it down.",
        "engagement": 592
    },
    {
        "text": "Let this be your reminder: You’re doing your best. LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn’t even apply for!' The catch? Pay Rs. 50,000 for the honor.",
        "engagement": 334
    },
    {
        "text": "The reality of job hunting hit me hard this week. Looking for jobs on LinkedIn is like online dating: Full of promises, but in the end, you’re just left ghosted.",
        "engagement": 416
    },
    {
        "text": "Today, I chose rest over endless scrolling. So when I left a toxic work environment, I told my manager a simple thing and felt so good.",
        "engagement": 249
    },
    {
        "text": "Today, I chose rest over endless scrolling. sapne dekhna achi baat hai, lekin job ka sapna dekh ke 'interested' likhna, yeh toh achi baat nahi hai na?",
        "engagement": 709
    },
    {
        "text": "So when I left a toxic work environment, I told my manager a simple thing and felt so good. Today, I chose rest over endless scrolling.",
        "engagement": 271
    },
    {
        "text": "Every time I poured my heart into 5-6 rounds of interviews and faced rejection, it felt like a punch in the gut. Every post I read makes me feel more human.",
        "engagement": 1174
    },
    {
        "text": "So when I left a toxic work environment, I told my manager a simple thing and felt so good. No offer letter is worth losing your mental peace over.",
        "engagement": 688
    },
    {
        "text": "Looking for jobs on LinkedIn is like online dating: Full of promises, but in the end, you’re just left ghosted. Every post I read makes me feel more human.",
        "engagement": 1039
    },
    {
        "text": "Next time when I'll be reading some LinkedIn Influencer's story, I am starting from the last line. If there's a link attached to it, it's most probably a fake one. The reality of job hunting hit me hard this week.",
        "engagement": 248
    },
    {
        "text": "Every time I poured my heart into 5-6 rounds of interviews and faced rejection, it felt like a punch in the gut. The reality of job hunting hit me hard this week.",
        "engagement": 471
    },
    {
        "text": "Next time when I'll be reading some LinkedIn Influencer's story, I am starting from the last line. If there's a link attached to it, it's most probably a fake one. Every post I read makes me feel more human.",
        "engagement": 209
    },
    {
        "text": "Even my dog thinks I’m employed with how much I’m on my laptop. Jobseekers, this one’s for you. Every application, every interview, every follow-up… the pressure is immense.",
        "engagement": 495
    },
    {
        "text": "LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn’t even apply for!' The catch? Pay Rs. 50,000 for the honor. Even my dog thinks I’m employed with how much I’m on my laptop.",
        "engagement": 1058
    },
    {
        "text": "sapne dekhna achi baat hai, lekin job ka sapna dekh ke 'interested' likhna, yeh toh achi baat nahi hai na? Let your ambition be louder than their rejections.",
        "engagement": 390
    },
    {
        "text": "Let’s normalize rejections and not tie them to our self-worth. LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn’t even apply for!' The catch? Pay Rs. 50,000 for the honor.",
        "engagement": 275
    },
    {
        "text": "Let’s normalize rejections and not tie them to our self-worth. Next time when I'll be reading some LinkedIn Influencer's story, I am starting from the last line. If there's a link attached to it, it's most probably a fake one.",
        "engagement": 1098
    },
    {
        "text": "To everyone who's still looking for a job... I see you. I feel you. A recruiter once told me, 'You’re great, but not for us.'",
        "engagement": 744
    },
    {
        "text": "Even my dog thinks I’m employed with how much I’m on my laptop. LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn’t even apply for!' The catch? Pay Rs. 50,000 for the honor.",
        "engagement": 219
    },
    {
        "text": "Let’s normalize rejections and not tie them to our self-worth. Looking for jobs on LinkedIn is like online dating: Full of promises, but in the end, you’re just left ghosted.",
        "engagement": 1107
    },
    {
        "text": "Looking for jobs on LinkedIn is like online dating: Full of promises, but in the end, you’re just left ghosted. Let’s normalize rejections and not tie them to our self-worth.",
        "engagement": 322
    },
    {
        "text": "Today, I chose rest over endless scrolling. So when I left a toxic work environment, I told my manager a simple thing and felt so good.",
        "engagement": 414
    },
    {
        "text": "To everyone who's still looking for a job... I see you. I feel you. Every post I read makes me feel more human.",
        "engagement": 746
    },
    {
        "text": "Let this be your reminder: You’re doing your best. Just saw a LinkedIn Influencer with 'Organic Growth' written in the profile with 65K+ followers claiming that he can help you in growing your platform, copying the posts from other influencers.",
        "engagement": 442
    },
    {
        "text": "sapne dekhna achi baat hai, lekin job ka sapna dekh ke 'interested' likhna, yeh toh achi baat nahi hai na? A recruiter once told me, 'You’re great, but not for us.'",
        "engagement": 129
    },
    {
        "text": "No offer letter is worth losing your mental peace over. Sometimes, we forget that a company’s brand name doesn’t define someone’s talent.",
        "engagement": 439
    },
    {
        "text": "I once met someone who got ghosted after 9 rounds. Just saw a LinkedIn Influencer with 'Organic Growth' written in the profile with 65K+ followers claiming that he can help you in growing your platform, copying the posts from other influencers.",
        "engagement": 765
    },
    {
        "text": "Jobseekers, this one’s for you. Every application, every interview, every follow-up… the pressure is immense. Let your ambition be louder than their rejections.",
        "engagement": 774
    },
    {
        "text": "So when I left a toxic work environment, I told my manager a simple thing and felt so good. Let’s normalize rejections and not tie them to our self-worth.",
        "engagement": 96
    },
    {
        "text": "Every post I read makes me feel more human. Next time when I'll be reading some LinkedIn Influencer's story, I am starting from the last line. If there's a link attached to it, it's most probably a fake one.",
        "engagement": 589
    },
    {
        "text": "Let this be your reminder: You’re doing your best. LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn’t even apply for!' The catch? Pay Rs. 50,000 for the honor.",
        "engagement": 265
    },
    {
        "text": "Even my dog thinks I’m employed with how much I’m on my laptop. Next time when I'll be reading some LinkedIn Influencer's story, I am starting from the last line. If there's a link attached to it, it's most probably a fake one.",
        "engagement": 254
    },
    {
        "text": "Sometimes, we forget that a company’s brand name doesn’t define someone’s talent. Let this be your reminder: You’re doing your best.",
        "engagement": 546
    },
    {
        "text": "Let your ambition be louder than their rejections. I was once told that I was too ambitious, too driven, and that I should tone it down.",
        "engagement": 689
    },
    {
        "text": "Let’s normalize rejections and not tie them to our self-worth. sapne dekhna achi baat hai, lekin job ka sapna dekh ke 'interested' likhna, yeh toh achi baat nahi hai na?",
        "engagement": 915
    },
    {
        "text": "Looking for jobs on LinkedIn is like online dating: Full of promises, but in the end, you’re just left ghosted. A recruiter once told me, 'You’re great, but not for us.'",
        "engagement": 487
    },
    {
        "text": "Let this be your reminder: You’re doing your best. Every time I poured my heart into 5-6 rounds of interviews and faced rejection, it felt like a punch in the gut.",
        "engagement": 966
    },
    {
        "text": "Every time I poured my heart into 5-6 rounds of interviews and faced rejection, it felt like a punch in the gut. The reality of job hunting hit me hard this week.",
        "engagement": 102
    },
    {
        "text": "Today, I chose rest over endless scrolling. So when I left a toxic work environment, I told my manager a simple thing and felt so good.",
        "engagement": 852
    },
    {
        "text": "Let your ambition be louder than their rejections. So when I left a toxic work environment, I told my manager a simple thing and felt so good.",
        "engagement": 403
    },
    {
        "text": "Every post I read makes me feel more human. To everyone who's still looking for a job... I see you. I feel you.",
        "engagement": 710
    },
    {
        "text": "So when I left a toxic work environment, I told my manager a simple thing and felt so good. Let this be your reminder: You’re doing your best.",
        "engagement": 648
    },
    {
        "text": "Jobseekers, this one’s for you. Every application, every interview, every follow-up… the pressure is immense. Let your ambition be louder than their rejections.",
        "engagement": 825
    },
    {
        "text": "Every post I read makes me feel more human. I was once told that I was too ambitious, too driven, and that I should tone it down.",
        "engagement": 1031
    },
    {
        "text": "Even my dog thinks I’m employed with how much I’m on my laptop. Sometimes, we forget that a company’s brand name doesn’t define someone’s talent.",
        "engagement": 1043
    },
    {
        "text": "Just saw a LinkedIn Influencer with 'Organic Growth' written in the profile with 65K+ followers claiming that he can help you in growing your platform, copying the posts from other influencers. The reality of job hunting hit me hard this week.",
        "engagement": 845
    },
    {
        "text": "Sometimes, we forget that a company’s brand name doesn’t define someone’s talent. The reality of job hunting hit me hard this week.",
        "engagement": 1069
    },
    {
        "text": "Let’s normalize rejections and not tie them to our self-worth. Every time I poured my heart into 5-6 rounds of interviews and faced rejection, it felt like a punch in the gut.",
        "engagement": 1093
    },
    {
        "text": "sapne dekhna achi baat hai, lekin job ka sapna dekh ke 'interested' likhna, yeh toh achi baat nahi hai na? A recruiter once told me, 'You’re great, but not for us.'",
        "engagement": 1141
    },
    {
        "text": "Jobseekers, this one’s for you. Every application, every interview, every follow-up… the pressure is immense. Let this be your reminder: You’re doing your best.",
        "engagement": 560
    },
    {
        "text": "I once met someone who got ghosted after 9 rounds. Sometimes, we forget that a company’s brand name doesn’t define someone’s talent.",
        "engagement": 1155
        }
    ]